In [1]:
import pandas as pd
import numpy as np

# 代入数据

In [2]:
filepath = "../data/trajectories(table 5)_training.csv"

In [3]:
raw_data = pd.read_csv(filepath)

In [4]:
raw_data

,intersection_id,tollgate_id,vehicle_id,starting_time,travel_seq,travel_time
0,B,3,1065642,2016-07-19 00:14:24,105#2016-07-19 00:14:24#9.56;100#2016-07-19 00...,70.85
1,B,3,1047198,2016-07-19 00:35:56,105#2016-07-19 00:35:56#11.58;100#2016-07-19 0...,148.79
2,B,1,1086390,2016-07-19 00:37:15,105#2016-07-19 00:37:15#5.26;100#2016-07-19 00...,79.76
3,A,2,1071181,2016-07-19 00:37:59,110#2016-07-19 00:37:59#13.74;123#2016-07-19 0...,58.05
4,B,1,1065807,2016-07-19 00:56:21,105#2016-07-19 00:56:21#16.08;100#2016-07-19 0...,137.98
5,C,3,1072812,2016-07-19 00:56:31,115#2016-07-19 00:56:31#10.97;102#2016-07-19 0...,113.54
6,B,1,1014648,2016-07-19 01:26:03,105#2016-07-19 01:26:03#16.85;100#2016-07-19 0...,176.70
7,A,2,1063919,2016-07-19 01:36:04,110#2016-07-19 01:36:04#10.39;123#2016-07-19 0...,74.47
8,A,3,1064408,2016-07-19 01:36:20,110#2016-07-19 01:36:20#8.58;123#2016-07-19 01...,94.57
9,C,1,1056529,2016-07-19 01:36:28,115#2016-07-19 01:36:28#9.50;102#2016-07-19 01...,214.87
10,A,2,1002179,2016-07-19 01:38:48,110#2016-07-19 01:38:48#8.25;123#2016-07-19 01...,39.27
11,B,3,1056879,2016-07-19 01:40:40,105#2016-07-19 01:40:40#11.40;100#2016-07-19 0...,86.07
12,A,2,1004088,2016-07-19 01:42:22,110#2016-07-19 01:42:22#8.32;123#2016-07-19 01...,35.38
13,C,1,1063652,2016-07-19 01:44:57,115#2016-07-19 01:44:57#7.47;102#2016-07-19 01...,189.77
14,C,1,1057504,2016-07-19 01:46:36,115#2016-07-19 01:46:36#6.77;102#2016-07-19 01...,131.50
15,A,2,1022331,2016-07-19 01:48:40,110#2016-07-19 01:48:40#9.51;123#2016-07-19 01...,130.43
16,B,3,1053843,2016-07-19 01:48:47,105#2016-07-19 01:48:47#34.41;100#2016-07-19 0...,101.37
17,A,2,1004286,2016-07-19 01:52:08,110#2016-07-19 01:52:08#18.05;123#2016-07-19 0...,67.41
18,B,3,1086111,2016-07-19 02:10:44,105#2016-07-19 02:10:44#5.17;100#2016-07-19 02...,67.81
19,A,2,1065328,2016-07-19 02:20:16,110#2016-07-19 02:20:16#10.07;123#2016-07-19 0...,42.64
20,A,3,1054620,2016-07-19 02:36:20,110#2016-07-19 02:36:20#7.42;123#2016-07-19 02...,72.12
21,A,3,1011942,2016-07-19 02:38:10,110#2016-07-19 02:38:10#8.22;123#2016-07-19 02...,83.10
22,B,3,1058173,2016-07-19 02:42:15,105#2016-07-19 02:42:15#17.66;100#2016-07-19 0...,142.32
23,A,2,1027642,2016-07-19 02:42:22,110#2016-07-19 02:42:22#6.65;123#2016-07-19 02...,29.15
24,A,2,1005189,2016-07-19 02:42:24,110#2016-07-19 02:42:24#7.54;123#2016-07-19 02...,40.12
25,B,3,1043567,2016-07-19 02:44:00,105#2016-07-19 02:44:00#11.50;100#2016-07-19 0...,192.77
26,A,2,1056068,2016-07-19 02:58:39,110#2016-07-19 02:58:39#9.42;123#2016-07-19 02...,51.25
27,A,3,1017831,2016-07-19 03:12:37,110#2016-07-19 03:12:37#7.48;123#2016-07-19 03...,93.09
28,A,2,1055860,2016-07-19 03:27:36,110#2016-07-19 03:27:36#11.44;123#2016-07-19 0...,44.29
29,A,2,1085652,2016-07-19 03:36:02,110#2016-07-19 03:36:02#11.39;123#2016-07-19 0...,39.55
...,...,...,...,...,...,...
109214,C,1,1020280,2016-10-17 22:35:53,115#2016-10-17 22:35:53#12.38;102#2016-10-17 2...,117.84
109215,C,3,1016880,2016-10-17 22:42:49,115#2016-10-17 22:42:49#8.47;102#2016-10-17 22...,189.38
109216,A,2,1045083,2016-10-17 22:45:00,110#2016-10-17 22:45:00#19.22;123#2016-10-17 2...,67.98
109217,A,3,1011400,2016-10-17 22:50:11,110#2016-10-17 22:50:11#10.77;123#2016-10-17 2...,83.76
109218,A,2,1043473,2016-10-17 22:50:23,110#2016-10-17 22:50:23#9.96;123#2016-10-17 22...,53.01
109219,B,3,1035615,2016-10-17 22:51:12,105#2016-10-17 22:51:12#8.30;100#2016-10-17 22...,60.92
109220,A,2,1027124,2016-10-17 22:56:18,110#2016-10-17 22:56:18#8.83;123#2016-10-17 22...,46.50
109221,C,3,1043900,2016-10-17 22:57:13,115#2016-10-17 22:57:13#7.75;102#2016-10-17 22...,111.67
109222,A,2,1022578,2016-10-17 23:06:06,110#2016-10-17 23:06:06#10.28;123#2016-10-17 2...,45.52
109223,B,3,1049127,2016-10-17 23:07:24,105#2016-10-17 23:07:24#9.49;100#2016-10-17 23...,60.49
109224,A,3,1042839,2016-10-17 23:08:13,110#2016-10-17 23:08:13#9.63;123#2016-10-17 23...,104.54
109225,A,2,1002950,2016-10-17 23:08:18,110#2016-10-17 23:08:18#10.31;123#2016-10-17 2...,48.36
109226,A,3,1018469,2016-10-17 23:10:45,110#2016-10-17 23:10:45#9.21;123#2016-10-17 23...,102.83
109227,C,1,1048639,2016-10-17 23:13:29,115#2016-10-17 23:13:29#7.28;102#2016-10-17 23...,194.33
109228,A,2,1000448,2016-10-17 23:14:16,110#2016-10-17 23:14:16#12.20;123#2016-10-17 2...,48.04
109229,A,2,1004272,2016-10-17 23:14:17,110#2016-10-17 23:14:17#11.13;123#2016-10-17 2...,61.68
109230,C,1,1031989,2016-10-17 23:20:17,115#2016-10-17 23:20:17#9.86;102#2016-10-17 23...,159.78
109231,A,2,1010568,2016-10-17 23:21:50,110#2016-10-17 23:21:50#13.24;123#2016-10-17 2...,40.29
109232,A,2,1037457,2016-10-17 23:22:08,110#2016-10-17 23:22:08#31.53;123#2016-10-17 2...,123.37
109233,A,2,1009417,2016-10-17 23:22:19,110#2016-10-17 23:22:19#22.78;123#2016-10-17 2...,124.41
109234,B,3,1047183,2016-10-17 23:29:43,105#2016-10-17 23:29:43#20.17;100#2016-10-17 2...,131.68
109235,A,2,1012726,2016-10-17 23:30:10,110#2016-10-17 23:30:10#13.46;123#2016-10-17 2...,55.54
109236,A,3,1004601,2016-10-17 23:30:43,110#2016-10-17 23:30:43#9.19;123#2016-10-17 23...,222.87
109237,A,3,1035614,2016-10-17 23:35:56,110#2016-10-17 23:35:56#11.74;123#2016-10-17 2...,91.59
109238,B,1,1003456,2016-10-17 23:37:31,105#2016-10-17 23:37:31#9.95;100#2016-10-17 23...,97.54
109239,A,2,1027763,2016-10-17 23:38:52,110#2016-10-17 23:38:52#8.91;123#2016-10-17 23...,52.46
109240,A,2,1051052,2016-10-17 23:40:19,110#2016-10-17 23:40:19#11.87;123#2016-10-17 2...,42.27
109241,A,3,1003251,2016-10-17 23:52:18,110#2016-10-17 23:52:18#7.59;123#2016-10-17 23...,71.94
109242,A,3,1041002,2016-10-17 23:53:57,110#2016-10-17 23:53:57#10.56;123#2016-10-17 2...,132.51
109243,A,3,1017582,2016-10-17 23:54:35,110#2016-10-17 23:54:35#9.10;123#2016-10-17 23...,137.38

# 各种统计

以 vehicle_id, starting_time, travel_time 作为文档中说的 id,date, travel_time

## a

统计 id的个数 。

In [11]:
raw_data.shape

(109244, 6)

In [12]:
raw_data.count()

intersection_id    109244
tollgate_id        109244
vehicle_id         109244
starting_time      109244
travel_seq         109244
travel_time        109244
dtype: int64

In [10]:
# 去重后计算id的数量
pd.unique(raw_data['vehicle_id']).shape[0]

77012

In [20]:
groups = raw_data.groupby('vehicle_id')

In [31]:
groups.count().head()

,intersection_id,tollgate_id,starting_time,travel_seq,travel_time
vehicle_id,,,,,
1000004,51,51,51,51,51
1000005,6,6,6,6,6
1000006,1,1,1,1,1
1000007,14,14,14,14,14
1000008,1,1,1,1,1

In [29]:
groups.count().shape

(77012, 5)

In [14]:
pd.unique(raw_data['intersection_id']).shape[0]

3

In [15]:
pd.unique(raw_data['tollgate_id']).shape[0]

3

## b

In [32]:
groups_1 = raw_data.groupby('vehicle_id')

In [38]:
# 均值
groups_1.mean().head()

            tollgate_id  travel_time
vehicle_id
1000004        2.784314    91.219412
1000005        1.833333    86.455000
1000006        3.000000   189.500000
1000007        2.285714    91.496429
1000008        3.000000   149.250000

In [41]:
# 标准差
groups_1.std().head()

            tollgate_id  travel_time
vehicle_id
1000004        0.415390    26.230348
1000005        0.408248    48.075296
1000006             NaN          NaN
1000007        0.468807    65.771463
1000008             NaN          NaN

In [50]:
# 最大值
groups_1.apply(lambda s:s['travel_time'].max())

vehicle_id
1000004    171.52
1000005    177.14
1000006    189.50
1000007    262.73
1000008    149.25
1000009    246.32
1000010    100.88
1000011     89.77
1000012     36.80
1000014     52.28
1000015    210.45
1000016     43.32
1000017    125.32
1000019    171.88
1000020     59.49
1000021    121.74
1000022     99.24
1000023    129.30
1000024     58.86
1000025     40.79
1000026    451.94
1000027     61.18
1000031    563.34
1000033    248.45
1000034     80.03
1000035    230.79
1000036    352.88
1000040     89.14
1000044    191.32
1000045     20.99
            ...
1088950     46.86
1088951    186.26
1088952     39.62
1088953     20.83
1088954     95.77
1088955     85.97
1088956    103.67
1088957     76.77
1088958    218.48
1088959     88.52
1088960     72.19
1088961     68.48
1088962    113.01
1088963     78.72
1088964    168.52
1088965     70.02
1088966     71.98
1088967     91.25
1088968    174.02
1088969     93.84
1088970    111.30
1088971     53.53
1088972    272.32
1088973     62.26
1088974    138.37
1088975     58.45
1088976     65.37
1088977     89.11
1088978    113.06
1088979     92.24
Length: 77012, dtype: float64

In [51]:
# 最小值
groups_1.apply(lambda s:s['travel_time'].min())

vehicle_id
1000004     43.25
1000005     46.26
1000006    189.50
1000007     33.62
1000008    149.25
1000009    246.32
1000010    100.88
1000011     89.77
1000012     36.80
1000014     50.44
1000015     48.85
1000016     43.32
1000017     71.63
1000019     95.52
1000020     59.49
1000021    115.78
1000022     99.09
1000023    106.28
1000024     47.33
1000025     40.79
1000026     24.69
1000027     35.62
1000031     17.22
1000033     57.41
1000034     80.03
1000035     38.75
1000036     32.69
1000040     80.08
1000044    191.32
1000045     20.99
            ...
1088950     46.86
1088951    186.26
1088952     39.62
1088953     20.83
1088954     95.77
1088955     85.97
1088956    103.67
1088957     76.77
1088958    218.48
1088959     88.52
1088960     72.19
1088961     68.48
1088962    113.01
1088963     78.72
1088964    168.52
1088965     70.02
1088966     71.98
1088967     91.25
1088968    174.02
1088969     93.84
1088970    111.30
1088971     53.53
1088972    272.32
1088973     62.26
1088974    138.37
1088975     58.45
1088976     65.37
1088977     89.11
1088978    113.06
1088979     92.24
Length: 77012, dtype: float64

In [53]:
# 中位数
groups_1.apply(lambda s : s['travel_time'].median())

vehicle_id
1000004     87.890
1000005     66.745
1000006    189.500
1000007     60.355
1000008    149.250
1000009    246.320
1000010    100.880
1000011     89.770
1000012     36.800
1000014     51.360
1000015     72.450
1000016     43.320
1000017     88.090
1000019    117.860
1000020     59.490
1000021    118.760
1000022     99.165
1000023    117.790
1000024     53.095
1000025     40.790
1000026    140.740
1000027     48.400
1000031     66.395
1000033    107.360
1000034     80.030
1000035     56.145
1000036    168.345
1000040     86.590
1000044    191.320
1000045     20.990
            ...
1088950     46.860
1088951    186.260
1088952     39.620
1088953     20.830
1088954     95.770
1088955     85.970
1088956    103.670
1088957     76.770
1088958    218.480
1088959     88.520
1088960     72.190
1088961     68.480
1088962    113.010
1088963     78.720
1088964    168.520
1088965     70.020
1088966     71.980
1088967     91.250
1088968    174.020
1088969     93.840
1088970    111.300
1088971     53.530
1088972    272.320
1088973     62.260
1088974    138.370
1088975     58.450
1088976     65.370
1088977     89.110
1088978    113.060
1088979     92.240
Length: 77012, dtype: float64

## c

问题：怎么对date进行分组，同一天的分到同一组

解决：新增一列date列，其中只有日期，没有精确时间

In [63]:
raw_data['date'] = raw_data.apply(lambda s : s['starting_time'].split(' ')[0].strip(), axis=1)

In [76]:
# 已完成按日期分组
groups_2 = raw_data.loc[:,['date', 'travel_time']].groupby('date')

In [77]:
# 均值
groups_2.mean().head()

            travel_time
date
2016-07-19   101.204590
2016-07-20   111.459090
2016-07-21   101.879754
2016-07-22   103.920283
2016-07-23   117.516890

In [78]:
# 标准差
groups_2.std().head()

            travel_time
date
2016-07-19    59.738921
2016-07-20    75.000627
2016-07-21    61.771261
2016-07-22    60.104545
2016-07-23    70.284321

In [79]:
# 最大值
groups_2.max().head()

            travel_time
date
2016-07-19       468.88
2016-07-20       917.06
2016-07-21       761.41
2016-07-22       765.15
2016-07-23       861.10

In [80]:
# 最小值
groups_2.min().head()

            travel_time
date
2016-07-19         9.43
2016-07-20        13.82
2016-07-21        12.33
2016-07-22         9.29
2016-07-23        11.88

In [81]:
# 中位数
groups_2.median().head()

            travel_time
date
2016-07-19       89.190
2016-07-20       93.620
2016-07-21       88.695
2016-07-22       94.270
2016-07-23      105.280

## d题

In [85]:
groups_3 = raw_data.loc[:,['vehicle_id','date', 'travel_time']].groupby(['vehicle_id', 'date'])

In [88]:
# 均值
groups_3.mean().head()

                       travel_time
vehicle_id date
1000004    2016-07-20        73.13
           2016-07-23       110.05
           2016-07-25        69.10
           2016-07-27       116.94
           2016-07-28        75.57

In [90]:
# 标准差
groups_3.std().head()

                       travel_time
vehicle_id date
1000004    2016-07-20          NaN
           2016-07-23          NaN
           2016-07-25          NaN
           2016-07-27          NaN
           2016-07-28          NaN

In [91]:
# 最大值
groups_3.max().head()

                       travel_time
vehicle_id date
1000004    2016-07-20        73.13
           2016-07-23       110.05
           2016-07-25        69.10
           2016-07-27       116.94
           2016-07-28        75.57

In [92]:
# 最小值
groups_3.min().head()

                       travel_time
vehicle_id date
1000004    2016-07-20        73.13
           2016-07-23       110.05
           2016-07-25        69.10
           2016-07-27       116.94
           2016-07-28        75.57

In [93]:
# 中位数
groups_3.median().head()

                       travel_time
vehicle_id date
1000004    2016-07-20        73.13
           2016-07-23       110.05
           2016-07-25        69.10
           2016-07-27       116.94
           2016-07-28        75.57

## e

In [107]:
def get_hour(s):
    words = s['starting_time'].split(' ')
    times = words[1].split(':')
    return words[0].strip() + ' ' + times[0].strip()

In [108]:
raw_data['hour'] = raw_data.apply(lambda s : get_hour(s), axis=1)

In [110]:
groups_4 = raw_data.loc[:,['hour', 'travel_time']].groupby('hour')

In [112]:
# 均值
groups_4.mean().head()

               travel_time
hour
2016-07-19 00   101.495000
2016-07-19 01   111.817500
2016-07-19 02    80.142222
2016-07-19 03    68.918000
2016-07-19 04    72.496667

In [114]:
# 标准差
groups_4.std().head()

               travel_time
hour
2016-07-19 00    37.448761
2016-07-19 01    58.139509
2016-07-19 02    53.874209
2016-07-19 03    32.586125
2016-07-19 04    33.855849

In [115]:
# 最大值
groups_4.max().head()

               travel_time
hour
2016-07-19 00       148.79
2016-07-19 01       214.87
2016-07-19 02       192.77
2016-07-19 03       121.02
2016-07-19 04       187.30

In [116]:
# 最小值
groups_4.min().head()

               travel_time
hour
2016-07-19 00        58.05
2016-07-19 01        35.38
2016-07-19 02        29.15
2016-07-19 03        23.03
2016-07-19 04        42.81

In [117]:
# 中位数
groups_4.min().head()

               travel_time
hour
2016-07-19 00        58.05
2016-07-19 01        35.38
2016-07-19 02        29.15
2016-07-19 03        23.03
2016-07-19 04        42.81